SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                       ##    #
#  #   #   #    #  #                #  #  #
#  #####   #   ###    ###  #  #       #  ####
#  #   #   #    #  #  #  # #  #      #   #   #
#  #   #   #    #  #  #  #  ###     ####  ###
#_____________________________#_________________________________________________
                           ###

attiny26.build.board=AVR_ATTINY26
attiny26.build.core=tiny
attiny26.build.variant=tiny26
attiny26.build.export_merged_output=false
attiny26.bootloader.extended_fuses=0xFE
attiny26.bootloader.high_fuses=0b{bootloader.rstbit}1110{bootloader.eesave_bit}{bootloader.bod_bits}
attiny26.bootloader.rstbit=1
attiny26.build.usbpinset=
attiny26.build.tuneorcal=
attiny26.build.softserabr=
attiny26.build.softser=
attiny26.build.wiremodeabr=
attiny26.build.wiremode=
attiny26.build.pinmapabr=
attiny26.upload.tool=avrdude
attiny26.bootloader.tool=avrdude
attiny26.build.bootloader=
attiny26.build.bootloaderabr=
attiny26.bootloader.flashstring=

#########################
# Optimization menu     #
#########################
attiny26.menu.optimization.size=-Os (size, recommended)
attiny26.menu.optimization.othree=-O3 (speed)
attiny26.menu.optimization.debug=-Og (for advanced debugging)
attiny26.menu.optimization.size.build.optimize=-Os
attiny26.menu.optimization.othree.build.optimize=-O3
attiny26.menu.optimization.debug.build.optimize=-Og
attiny26.build.mcu=attiny26
attiny26.upload.maximum_size=2048
attiny26.upload.maximum_data_size=128

#########################
# Clocking menu options #
#########################
attiny26.menu.clock.internal_8m=8 MHz (internal)
attiny26.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attiny26.menu.clock.internal_8m.build.f_cpu=8000000L
attiny26.menu.clock.internal_8m.build.speed=8m
attiny26.menu.clock.internal_8m.build.clocksource=0
attiny26.menu.clock.internal_1m=1 MHz (internal)
attiny26.menu.clock.internal_1m.bootloader.low_fuses=0x62
attiny26.menu.clock.internal_1m.build.f_cpu=1000000L
attiny26.menu.clock.internal_1m.build.speed=1m
attiny26.menu.clock.internal_1m.build.clocksource=0x10
attiny26.menu.clock.internal_4m=4 MHz (internal)
attiny26.menu.clock.internal_4m.bootloader.low_fuses=0x62
attiny26.menu.clock.internal_4m.build.f_cpu=4000000L
attiny26.menu.clock.internal_4m.build.speed=4m
attiny26.menu.clock.internal_4m.build.clocksource=0x10
attiny26.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attiny26.menu.clock.internal_2m=2 MHz (internal)
attiny26.menu.clock.internal_2m.bootloader.low_fuses=0x62
attiny26.menu.clock.internal_2m.build.f_cpu=2000000L
attiny26.menu.clock.internal_2m.build.speed=2m
attiny26.menu.clock.internal_2m.build.clocksource=0x10
attiny26.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attiny26.menu.clock.pll_16m=16 MHz (PLL)
attiny26.menu.clock.pll_16m.bootloader.low_fuses=0xF1
attiny26.menu.clock.pll_16m.build.f_cpu=16000000L
attiny26.menu.clock.pll_16m.build.speed=16m
attiny26.menu.clock.pll_16m.build.clocksource=6
attiny26.menu.clock.pll_16m5=16.5 MHz (PLL, tweaked)
attiny26.menu.clock.pll_16m5.bootloader.low_fuses=0xF1
attiny26.menu.clock.pll_16m5.build.f_cpu=16500000L
attiny26.menu.clock.pll_16m5.build.speed=16m5
attiny26.menu.clock.pll_16m5.build.clocksource=6
attiny26.menu.clock.crystal_16m=16 MHz (crystal)
attiny26.menu.clock.crystal_16m.bootloader.low_fuses=0xFF
attiny26.menu.clock.crystal_16m.build.f_cpu=16000000UL
attiny26.menu.clock.crystal_16m.build.speed=16
attiny26.menu.clock.crystal_16m.build.clocksource=1
attiny26.menu.clock.crystal_8m=8 MHz (crystal)
attiny26.menu.clock.crystal_8m.bootloader.low_fuses=0xFF
attiny26.menu.clock.crystal_8m.build.f_cpu=8000000UL
attiny26.menu.clock.crystal_8m.build.speed=8
attiny26.menu.clock.crystal_8m.build.clocksource=1
attiny26.menu.clock.crystal_20m=20 MHz (crystal)
attiny26.menu.clock.crystal_20m.bootloader.low_fuses=0xFF
attiny26.menu.clock.crystal_20m.build.f_cpu=20000000UL
attiny26.menu.clock.crystal_20m.build.speed=20
attiny26.menu.clock.crystal_20m.build.clocksource=1
attiny26.menu.clock.crystal_12m=12 MHz (crystal)
attiny26.menu.clock.crystal_12m.bootloader.low_fuses=0xFF
attiny26.menu.clock.crystal_12m.build.f_cpu=12000000UL
attiny26.menu.clock.crystal_12m.build.speed=12
attiny26.menu.clock.crystal_12m.build.clocksource=1
attiny26.menu.clock.crystal_6m=6 MHz (crystal)
attiny26.menu.clock.crystal_6m.bootloader.low_fuses=0xFD
attiny26.menu.clock.crystal_6m.build.f_cpu=6000000UL
attiny26.menu.clock.crystal_6m.build.speed=6
attiny26.menu.clock.crystal_6m.build.clocksource=1
attiny26.menu.clock.crystal_18432k=18.432 MHz (crystal)
attiny26.menu.clock.crystal_18432k.bootloader.low_fuses=0xFF
attiny26.menu.clock.crystal_18432k.build.f_cpu=18432000UL
attiny26.menu.clock.crystal_18432k.build.speed=18432k
attiny26.menu.clock.crystal_18432k.build.clocksource=1
attiny26.menu.clock.crystal_14746k=14.746 MHz (crystal)
attiny26.menu.clock.crystal_14746k.bootloader.low_fuses=0xFF
attiny26.menu.clock.crystal_14746k.build.f_cpu=14746000UL
attiny26.menu.clock.crystal_14746k.build.speed=14746k
attiny26.menu.clock.crystal_14746k.build.clocksource=1
attiny26.menu.clock.crystal_11059k=11.059 MHz (crystal)
attiny26.menu.clock.crystal_11059k.bootloader.low_fuses=0xFF
attiny26.menu.clock.crystal_11059k.build.f_cpu=11059000UL
attiny26.menu.clock.crystal_11059k.build.speed=11059k
attiny26.menu.clock.crystal_11059k.build.clocksource=1
attiny26.menu.clock.crystal_9216k=9.216 MHz (crystal)
attiny26.menu.clock.crystal_9216k.bootloader.low_fuses=0xFF
attiny26.menu.clock.crystal_9216k.build.f_cpu=9216000UL
attiny26.menu.clock.crystal_9216k.build.speed=9216k
attiny26.menu.clock.crystal_9216k.build.clocksource=1
attiny26.menu.clock.crystal_7372k=7.372 MHz (crystal)
attiny26.menu.clock.crystal_7372k.bootloader.low_fuses=0xFD
attiny26.menu.clock.crystal_7372k.build.f_cpu=7372000UL
attiny26.menu.clock.crystal_7372k.build.speed=7372k
attiny26.menu.clock.crystal_7372k.build.clocksource=1
attiny26.menu.clock.internal_12m=12 MHz (internal, tuned)
attiny26.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attiny26.menu.clock.internal_12m.build.f_cpu=12000000L
attiny26.menu.clock.internal_12m.build.speed=12m
attiny26.menu.clock.internal_12m.build.clocksource=0
attiny26.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attiny26.menu.clock.internal_8m_tuned.bootloader.low_fuses=0xE2
attiny26.menu.clock.internal_8m_tuned.build.f_cpu=8000000L
attiny26.menu.clock.internal_8m_tuned.build.speed=8m
attiny26.menu.clock.internal_8m_tuned.build.clocksource=0
attiny26.menu.clock.extclk_16m=16 MHz (external clock)
attiny26.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attiny26.menu.clock.extclk_16m.build.f_cpu=16000000UL
attiny26.menu.clock.extclk_16m.build.speed=16
attiny26.menu.clock.extclk_16m.build.clocksource=2
attiny26.menu.clock.extclk_8m=8 MHz (external clock)
attiny26.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attiny26.menu.clock.extclk_8m.build.f_cpu=8000000UL
attiny26.menu.clock.extclk_8m.build.speed=8
attiny26.menu.clock.extclk_8m.build.clocksource=2
attiny26.menu.clock.extclk_20m=20 MHz (external clock)
attiny26.menu.clock.extclk_20m.bootloader.low_fuses=0xE0
attiny26.menu.clock.extclk_20m.build.f_cpu=20000000UL
attiny26.menu.clock.extclk_20m.build.speed=20
attiny26.menu.clock.extclk_20m.build.clocksource=2
attiny26.menu.clock.extclk_12m=12 MHz (external clock)
attiny26.menu.clock.extclk_12m.bootloader.low_fuses=0xE0
attiny26.menu.clock.extclk_12m.build.f_cpu=12000000UL
attiny26.menu.clock.extclk_12m.build.speed=12
attiny26.menu.clock.extclk_12m.build.clocksource=2
attiny26.menu.clock.extclk_6m=6 MHz (external clock)
attiny26.menu.clock.extclk_6m.bootloader.low_fuses=0xE0
attiny26.menu.clock.extclk_6m.build.f_cpu=6000000UL
attiny26.menu.clock.extclk_6m.build.speed=6
attiny26.menu.clock.extclk_6m.build.clocksource=2
attiny26.menu.clock.extclk_18432k=18.432 MHz (external clock)
attiny26.menu.clock.extclk_18432k.bootloader.low_fuses=0xE0
attiny26.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attiny26.menu.clock.extclk_18432k.build.speed=18432k
attiny26.menu.clock.extclk_18432k.build.clocksource=2
attiny26.menu.clock.extclk_14746k=14.746 MHz (external clock)
attiny26.menu.clock.extclk_14746k.bootloader.low_fuses=0xE0
attiny26.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attiny26.menu.clock.extclk_14746k.build.speed=14746k
attiny26.menu.clock.extclk_14746k.build.clocksource=2
attiny26.menu.clock.extclk_11059k=11.059 MHz (external clock)
attiny26.menu.clock.extclk_11059k.bootloader.low_fuses=0xE0
attiny26.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attiny26.menu.clock.extclk_11059k.build.speed=11059k
attiny26.menu.clock.extclk_11059k.build.clocksource=2
attiny26.menu.clock.extclk_9216k=9.216 MHz (external clock)
attiny26.menu.clock.extclk_9216k.bootloader.low_fuses=0xE0
attiny26.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attiny26.menu.clock.extclk_9216k.build.speed=9216k
attiny26.menu.clock.extclk_9216k.build.clocksource=2
attiny26.menu.clock.extclk_7372k=7.372 MHz (external clock)
attiny26.menu.clock.extclk_7372k.bootloader.low_fuses=0xE0
attiny26.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attiny26.menu.clock.extclk_7372k.build.speed=7372k
attiny26.menu.clock.extclk_7372k.build.clocksource=2

#########################
# Retain EEPROM menu    #
#########################
attiny26.menu.eesave.aenable=EEPROM retained
attiny26.menu.eesave.aenable.bootloader.eesave_bit=0
attiny26.menu.eesave.disable=EEPROM not retained
attiny26.menu.eesave.disable.bootloader.eesave_bit=1

#########################
# Software Serial menu  #
#########################
attiny26.menu.softserial.enable=RX on PA7, TX on PA (default PA6)
attiny26.menu.softserial.txonly=No receiving, transmit only.
attiny26.menu.softserial.txonly.build.softser=-DSOFT_TX_ONLY
attiny26.menu.softserial.txonly.build.softserabr=ssTX

#########################
# BrownOut Detect menu  #
#########################
attiny26.menu.bod.disable=B.O.D. Disabled (saves power)
attiny26.menu.bod.disable.bootloader.bod_bits=111
attiny26.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny26.menu.bod.1v8.bootloader.bod_bits=110
attiny26.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny26.menu.bod.2v7.bootloader.bod_bits=101
attiny26.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny26.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attiny26.menu.millis.enabled=Enabled
attiny26.menu.millis.enabled.build.millis=
attiny26.menu.millis.enabled.build.millisabr=
attiny26.menu.millis.disabled=Disabled (saves flash)
attiny26.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny26.menu.millis.disabled.build.millisabr=mNONE

