SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                       ###       ###
#  #   #   #    #  #                #   #     #   #       #  #
#  #####   #   ###    ###  #  # # #  ###      #   # ###  ###
#  #   #   #    #  #  #  # #  #  #  #   #     #   # #  #  #  #
#  #   #   #    #  #  #  #  ### # #  ###       ###  ###   #  #
#_____________________________#_____________________#___________________________
                           ###                      #

attinyx8opti.build.board=AVR_ATTINYX8
attinyx8opti.build.core=tiny
attinyx8opti.build.variant=tinyx8
attinyx8opti.build.export_merged_output=false
attinyx8opti.bootloader.extended_fuses=0xFE
attinyx8opti.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attinyx8opti.bootloader.rstbit=1
attinyx8opti.build.usbpinset=
attinyx8opti.build.tuneorcal=
attinyx8opti.build.softserabr=
attinyx8opti.build.softser=
attinyx8opti.build.wiremodeabr=
attinyx8opti.build.wiremode=
attinyx8opti.upload.tool=avrdude
attinyx8opti.bootloader.tool=avrdude
attinyx8opti.bootloader.flashstring=-Uflash:w:{bootloader.file}:i
attinyx8opti.build.bootloader=-DUSING_BOOTLOADER=0x01
attinyx8opti.build.bootloaderabr=opti
attinyx8opti.bootloader.speed={build.f_cpu}
attinyx8opti.upload.protocol=arduino
attinyx8opti.bootloader.uart=

#########################
# Optimization menu     #
#########################
attinyx8opti.menu.optimization.size=-Os (size, recommended)
attinyx8opti.menu.optimization.othree=-O3 (speed)
attinyx8opti.menu.optimization.debug=-Og (for advanced debugging)
attinyx8opti.menu.optimization.size.build.optimize=-Os
attinyx8opti.menu.optimization.othree.build.optimize=-O3
attinyx8opti.menu.optimization.debug.build.optimize=-Og

#########################
# Microcontroller menu  #
#########################
attinyx8opti.menu.chip.88=ATtiny88
attinyx8opti.menu.chip.88.build.mcu=attiny88
attinyx8opti.menu.chip.88.upload.maximum_size=7552
attinyx8opti.menu.chip.88.upload.maximum_data_size=512
attinyx8opti.menu.chip.48=ATtiny48
attinyx8opti.menu.chip.48.build.mcu=attiny48
attinyx8opti.menu.chip.48.upload.maximum_size=3456
attinyx8opti.menu.chip.48.upload.maximum_data_size=256

#########################
# Clocking menu options #
#########################
attinyx8opti.menu.clock.internal_8m=8 MHz (internal)
attinyx8opti.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attinyx8opti.menu.clock.internal_8m.build.f_cpu=8000000L
attinyx8opti.menu.clock.internal_8m.build.speed=8m
attinyx8opti.menu.clock.internal_8m.build.clocksource=0
attinyx8opti.menu.clock.internal_8m.upload.speed=28800
attinyx8opti.menu.clock.internal_1m=1 MHz (internal)
attinyx8opti.menu.clock.internal_1m.bootloader.low_fuses=0x62
attinyx8opti.menu.clock.internal_1m.build.f_cpu=1000000L
attinyx8opti.menu.clock.internal_1m.build.speed=1m
attinyx8opti.menu.clock.internal_1m.build.clocksource=0x10
attinyx8opti.menu.clock.internal_1m.upload.speed=4800
attinyx8opti.menu.clock.internal_4m=4 MHz (internal)
attinyx8opti.menu.clock.internal_4m.bootloader.low_fuses=0x62
attinyx8opti.menu.clock.internal_4m.build.f_cpu=4000000L
attinyx8opti.menu.clock.internal_4m.build.speed=4m
attinyx8opti.menu.clock.internal_4m.build.clocksource=0x10
attinyx8opti.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attinyx8opti.menu.clock.internal_4m.upload.speed=4800
attinyx8opti.menu.clock.internal_2m=2 MHz (internal)
attinyx8opti.menu.clock.internal_2m.bootloader.low_fuses=0x62
attinyx8opti.menu.clock.internal_2m.build.f_cpu=2000000L
attinyx8opti.menu.clock.internal_2m.build.speed=2m
attinyx8opti.menu.clock.internal_2m.build.clocksource=0x10
attinyx8opti.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attinyx8opti.menu.clock.internal_2m.upload.speed=4800
attinyx8opti.menu.clock.internal_12m=12 MHz (internal, tuned)
attinyx8opti.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attinyx8opti.menu.clock.internal_12m.build.f_cpu=12000000L
attinyx8opti.menu.clock.internal_12m.build.speed=12m
attinyx8opti.menu.clock.internal_12m.build.clocksource=0
attinyx8opti.menu.clock.internal_12m.upload.speed=57600
attinyx8opti.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attinyx8opti.menu.clock.internal_8m_tuned.bootloader.low_fuses=0xE2
attinyx8opti.menu.clock.internal_8m_tuned.build.f_cpu=8000000L
attinyx8opti.menu.clock.internal_8m_tuned.build.speed=8m
attinyx8opti.menu.clock.internal_8m_tuned.build.clocksource=0
attinyx8opti.menu.clock.internal_8m_tuned.upload.speed=28800
attinyx8opti.menu.clock.extclk_16m=16 MHz (external clock)
attinyx8opti.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.extclk_16m.build.f_cpu=16000000UL
attinyx8opti.menu.clock.extclk_16m.build.speed=16
attinyx8opti.menu.clock.extclk_16m.build.clocksource=2
attinyx8opti.menu.clock.extclk_16m.upload.speed=57600
attinyx8opti.menu.clock.extclk_8m=8 MHz (external clock)
attinyx8opti.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.extclk_8m.build.f_cpu=8000000UL
attinyx8opti.menu.clock.extclk_8m.build.speed=8
attinyx8opti.menu.clock.extclk_8m.build.clocksource=2
attinyx8opti.menu.clock.extclk_8m.upload.speed=28800
attinyx8opti.menu.clock.extclk_20m=20 MHz (external clock)
attinyx8opti.menu.clock.extclk_20m.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.extclk_20m.build.f_cpu=20000000UL
attinyx8opti.menu.clock.extclk_20m.build.speed=20
attinyx8opti.menu.clock.extclk_20m.build.clocksource=2
attinyx8opti.menu.clock.extclk_20m.upload.speed=57600
attinyx8opti.menu.clock.extclk_12m=12 MHz (external clock)
attinyx8opti.menu.clock.extclk_12m.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.extclk_12m.build.f_cpu=12000000UL
attinyx8opti.menu.clock.extclk_12m.build.speed=12
attinyx8opti.menu.clock.extclk_12m.build.clocksource=2
attinyx8opti.menu.clock.extclk_12m.upload.speed=57600
attinyx8opti.menu.clock.extclk_6m=6 MHz (external clock)
attinyx8opti.menu.clock.extclk_6m.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.extclk_6m.build.f_cpu=6000000UL
attinyx8opti.menu.clock.extclk_6m.build.speed=6
attinyx8opti.menu.clock.extclk_6m.build.clocksource=2
attinyx8opti.menu.clock.extclk_6m.upload.speed=28800
attinyx8opti.menu.clock.extclk_18432k=18.432 MHz (external clock)
attinyx8opti.menu.clock.extclk_18432k.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attinyx8opti.menu.clock.extclk_18432k.build.speed=18432k
attinyx8opti.menu.clock.extclk_18432k.build.clocksource=2
attinyx8opti.menu.clock.extclk_18432k.upload.speed=57600
attinyx8opti.menu.clock.extclk_14746k=14.746 MHz (external clock)
attinyx8opti.menu.clock.extclk_14746k.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attinyx8opti.menu.clock.extclk_14746k.build.speed=14746k
attinyx8opti.menu.clock.extclk_14746k.build.clocksource=2
attinyx8opti.menu.clock.extclk_14746k.upload.speed=57600
attinyx8opti.menu.clock.extclk_11059k=11.059 MHz (external clock)
attinyx8opti.menu.clock.extclk_11059k.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attinyx8opti.menu.clock.extclk_11059k.build.speed=11059k
attinyx8opti.menu.clock.extclk_11059k.build.clocksource=2
attinyx8opti.menu.clock.extclk_11059k.upload.speed=38400
attinyx8opti.menu.clock.extclk_9216k=9.216 MHz (external clock)
attinyx8opti.menu.clock.extclk_9216k.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attinyx8opti.menu.clock.extclk_9216k.build.speed=9216k
attinyx8opti.menu.clock.extclk_9216k.build.clocksource=2
attinyx8opti.menu.clock.extclk_9216k.upload.speed=38400
attinyx8opti.menu.clock.extclk_7372k=7.372 MHz (external clock)
attinyx8opti.menu.clock.extclk_7372k.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attinyx8opti.menu.clock.extclk_7372k.build.speed=7372k
attinyx8opti.menu.clock.extclk_7372k.build.clocksource=2
attinyx8opti.menu.clock.extclk_7372k.upload.speed=28800

#########################
# Pin Mapping menu      #
#########################
attinyx8opti.menu.pinmap.default=Standard
attinyx8opti.menu.pinmap.mhet=MH-ET Tiny
attinyx8opti.menu.pinmap.,mhet.build.variant=tinyx8_MH
attinyx8opti.menu.pinmap.default.build.pinmapabr=
attinyx8opti.menu.pinmap.mhet.build.pinmapabr=.mhet

#########################
# Software Serial menu  #
#########################
attinyx8opti.menu.softserial.enable=RX on PD7, TX on PD (default PD6)
attinyx8opti.menu.softserial.txonly=No receiving, transmit only.
attinyx8opti.menu.softserial.txonly.build.softser=-DSOFT_TX_ONLY
attinyx8opti.menu.softserial.txonly.build.softserabr=ssTX

#########################
# BrownOut Detect menu  #
#########################
attinyx8opti.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx8opti.menu.bod.disable.bootloader.bod_bits=111
attinyx8opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx8opti.menu.bod.1v8.bootloader.bod_bits=110
attinyx8opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx8opti.menu.bod.2v7.bootloader.bod_bits=101
attinyx8opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx8opti.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attinyx8opti.menu.millis.enabled=Enabled
attinyx8opti.menu.millis.enabled.build.millis=
attinyx8opti.menu.millis.enabled.build.millisabr=
attinyx8opti.menu.millis.disabled=Disabled (saves flash)
attinyx8opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx8opti.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attinyx8opti.menu.bootentry.1s=Standard (1s wait, for use w/autoreset)
attinyx8opti.menu.bootentry.1s.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.uart}.hex
attinyx8opti.menu.bootentry.8s=8-second (8s wait, for use w. out/autoreset)
attinyx8opti.menu.bootentry.8s_8sec.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.uart}_8sec.hex

