SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                      #####      ###
#  #   #   #    #  #                   #      #   #       #  #
#  #####   #   ###    ###  #  # # #   #       #   # ###  ###
#  #   #   #    #  #  #  # #  #  #    #       #   # #  #  #  #
#  #   #   #    #  #  #  #  ### # #   #        ###  ###   #  #
#_____________________________#_____________________#___________________________
                           ###                      #

attinyx7opti.build.board=AVR_ATTINYX7
attinyx7opti.build.core=tiny
attinyx7opti.build.variant=tinyx7
attinyx7opti.build.export_merged_output=false
attinyx7opti.bootloader.extended_fuses=0xFE
attinyx7opti.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attinyx7opti.bootloader.rstbit=1
attinyx7opti.build.usbpinset=
attinyx7opti.build.tuneorcal=
attinyx7opti.build.softserabr=
attinyx7opti.build.softser=
attinyx7opti.build.wiremodeabr=
attinyx7opti.build.wiremode=
attinyx7opti.upload.tool=avrdude
attinyx7opti.bootloader.tool=avrdude
attinyx7opti.bootloader.flashstring=-Uflash:w:{bootloader.file}:i
attinyx7opti.build.bootloader=-DUSING_BOOTLOADER=0x01
attinyx7opti.build.bootloaderabr=opti
attinyx7opti.bootloader.speed={build.f_cpu}
attinyx7opti.upload.protocol=arduino
attinyx7opti.bootloader.uart=

#########################
# Optimization menu     #
#########################
attinyx7opti.menu.optimization.size=-Os (size, recommended)
attinyx7opti.menu.optimization.othree=-O3 (speed)
attinyx7opti.menu.optimization.debug=-Og (for advanced debugging)
attinyx7opti.menu.optimization.size.build.optimize=-Os
attinyx7opti.menu.optimization.othree.build.optimize=-O3
attinyx7opti.menu.optimization.debug.build.optimize=-Og

#########################
# Microcontroller menu  #
#########################
attinyx7opti.menu.chip.167=ATtiny167
attinyx7opti.menu.chip.167.build.mcu=attiny167
attinyx7opti.menu.chip.167.upload.maximum_size=15744
attinyx7opti.menu.chip.87=ATtiny87
attinyx7opti.menu.chip.87.build.mcu=attiny87
attinyx7opti.menu.chip.87.upload.maximum_size=7552

#########################
# Clocking menu options #
#########################
attinyx7opti.menu.clock.internal_8m=8 MHz (internal)
attinyx7opti.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attinyx7opti.menu.clock.internal_8m.build.f_cpu=8000000L
attinyx7opti.menu.clock.internal_8m.build.speed=8m
attinyx7opti.menu.clock.internal_8m.build.clocksource=0
attinyx7opti.menu.clock.internal_8m.upload.speed=76800
attinyx7opti.menu.clock.internal_1m=1 MHz (internal)
attinyx7opti.menu.clock.internal_1m.bootloader.low_fuses=0x62
attinyx7opti.menu.clock.internal_1m.build.f_cpu=1000000L
attinyx7opti.menu.clock.internal_1m.build.speed=1m
attinyx7opti.menu.clock.internal_1m.build.clocksource=0x10
attinyx7opti.menu.clock.internal_1m.upload.speed=9600
attinyx7opti.menu.clock.internal_4m=4 MHz (internal)
attinyx7opti.menu.clock.internal_4m.bootloader.low_fuses=0x62
attinyx7opti.menu.clock.internal_4m.build.f_cpu=4000000L
attinyx7opti.menu.clock.internal_4m.build.speed=4m
attinyx7opti.menu.clock.internal_4m.build.clocksource=0x10
attinyx7opti.menu.clock.internal.4m.bootloader.f_cpu=1000000L
attinyx7opti.menu.clock.internal_4m.upload.speed=9600
attinyx7opti.menu.clock.internal_2m=2 MHz (internal)
attinyx7opti.menu.clock.internal_2m.bootloader.low_fuses=0x62
attinyx7opti.menu.clock.internal_2m.build.f_cpu=2000000L
attinyx7opti.menu.clock.internal_2m.build.speed=2m
attinyx7opti.menu.clock.internal_2m.build.clocksource=0x10
attinyx7opti.menu.clock.internal.2m.bootloader.f_cpu=1000000L
attinyx7opti.menu.clock.internal_2m.upload.speed=9600
attinyx7opti.menu.clock.crystal_16m=16 MHz (crystal)
attinyx7opti.menu.clock.crystal_16m.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.crystal_16m.build.f_cpu=16000000UL
attinyx7opti.menu.clock.crystal_16m.build.speed=16
attinyx7opti.menu.clock.crystal_16m.build.clocksource=1
attinyx7opti.menu.clock.crystal_8m=8 MHz (crystal)
attinyx7opti.menu.clock.crystal_8m.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.crystal_8m.build.f_cpu=8000000UL
attinyx7opti.menu.clock.crystal_8m.build.speed=8
attinyx7opti.menu.clock.crystal_8m.build.clocksource=1
attinyx7opti.menu.clock.crystal_20m=20 MHz (crystal)
attinyx7opti.menu.clock.crystal_20m.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.crystal_20m.build.f_cpu=20000000UL
attinyx7opti.menu.clock.crystal_20m.build.speed=20
attinyx7opti.menu.clock.crystal_20m.build.clocksource=1
attinyx7opti.menu.clock.crystal_12m=12 MHz (crystal)
attinyx7opti.menu.clock.crystal_12m.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.crystal_12m.build.f_cpu=12000000UL
attinyx7opti.menu.clock.crystal_12m.build.speed=12
attinyx7opti.menu.clock.crystal_12m.build.clocksource=1
attinyx7opti.menu.clock.crystal_6m=6 MHz (crystal)
attinyx7opti.menu.clock.crystal_6m.bootloader.low_fuses=0xFD
attinyx7opti.menu.clock.crystal_6m.build.f_cpu=6000000UL
attinyx7opti.menu.clock.crystal_6m.build.speed=6
attinyx7opti.menu.clock.crystal_6m.build.clocksource=1
attinyx7opti.menu.clock.crystal_18432k=18.432 MHz (crystal)
attinyx7opti.menu.clock.crystal_18432k.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.crystal_18432k.build.f_cpu=18432000UL
attinyx7opti.menu.clock.crystal_18432k.build.speed=18432k
attinyx7opti.menu.clock.crystal_18432k.build.clocksource=1
attinyx7opti.menu.clock.crystal_14746k=14.746 MHz (crystal)
attinyx7opti.menu.clock.crystal_14746k.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.crystal_14746k.build.f_cpu=14746000UL
attinyx7opti.menu.clock.crystal_14746k.build.speed=14746k
attinyx7opti.menu.clock.crystal_14746k.build.clocksource=1
attinyx7opti.menu.clock.crystal_11059k=11.059 MHz (crystal)
attinyx7opti.menu.clock.crystal_11059k.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.crystal_11059k.build.f_cpu=11059000UL
attinyx7opti.menu.clock.crystal_11059k.build.speed=11059k
attinyx7opti.menu.clock.crystal_11059k.build.clocksource=1
attinyx7opti.menu.clock.crystal_9216k=9.216 MHz (crystal)
attinyx7opti.menu.clock.crystal_9216k.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.crystal_9216k.build.f_cpu=9216000UL
attinyx7opti.menu.clock.crystal_9216k.build.speed=9216k
attinyx7opti.menu.clock.crystal_9216k.build.clocksource=1
attinyx7opti.menu.clock.crystal_7372k=7.372 MHz (crystal)
attinyx7opti.menu.clock.crystal_7372k.bootloader.low_fuses=0xFD
attinyx7opti.menu.clock.crystal_7372k.build.f_cpu=7372000UL
attinyx7opti.menu.clock.crystal_7372k.build.speed=7372k
attinyx7opti.menu.clock.crystal_7372k.build.clocksource=1
attinyx7opti.menu.clock.internal_12m=12 MHz (internal, tuned)
attinyx7opti.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attinyx7opti.menu.clock.internal_12m.build.f_cpu=12000000L
attinyx7opti.menu.clock.internal_12m.build.speed=12m
attinyx7opti.menu.clock.internal_12m.build.clocksource=0
attinyx7opti.menu.clock.internal_12m.upload.speed=115200
attinyx7opti.menu.clock.internal_8m_tuned=8 MHz (internal, tuned)
attinyx7opti.menu.clock.internal_8m_tuned.bootloader.low_fuses=0xE2
attinyx7opti.menu.clock.internal_8m_tuned.build.f_cpu=8000000L
attinyx7opti.menu.clock.internal_8m_tuned.build.speed=8m
attinyx7opti.menu.clock.internal_8m_tuned.build.clocksource=0
attinyx7opti.menu.clock.internal_8m_tuned.upload.speed=76800
attinyx7opti.menu.clock.extclk_16m=16 MHz (external clock)
attinyx7opti.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attinyx7opti.menu.clock.extclk_16m.build.f_cpu=16000000UL
attinyx7opti.menu.clock.extclk_16m.build.speed=16
attinyx7opti.menu.clock.extclk_16m.build.clocksource=2
attinyx7opti.menu.clock.extclk_16m.upload.speed=76800
attinyx7opti.menu.clock.extclk_8m=8 MHz (external clock)
attinyx7opti.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attinyx7opti.menu.clock.extclk_8m.build.f_cpu=8000000UL
attinyx7opti.menu.clock.extclk_8m.build.speed=8
attinyx7opti.menu.clock.extclk_8m.build.clocksource=2
attinyx7opti.menu.clock.extclk_8m.upload.speed=76800
attinyx7opti.menu.clock.extclk_20m=20 MHz (external clock)
attinyx7opti.menu.clock.extclk_20m.bootloader.low_fuses=0xE0
attinyx7opti.menu.clock.extclk_20m.build.f_cpu=20000000UL
attinyx7opti.menu.clock.extclk_20m.build.speed=20
attinyx7opti.menu.clock.extclk_20m.build.clocksource=2
attinyx7opti.menu.clock.extclk_20m.upload.speed=115200
attinyx7opti.menu.clock.extclk_12m=12 MHz (external clock)
attinyx7opti.menu.clock.extclk_12m.bootloader.low_fuses=0xE0
attinyx7opti.menu.clock.extclk_12m.build.f_cpu=12000000UL
attinyx7opti.menu.clock.extclk_12m.build.speed=12
attinyx7opti.menu.clock.extclk_12m.build.clocksource=2
attinyx7opti.menu.clock.extclk_12m.upload.speed=115200
attinyx7opti.menu.clock.extclk_6m=6 MHz (external clock)
attinyx7opti.menu.clock.extclk_6m.bootloader.low_fuses=0xE0
attinyx7opti.menu.clock.extclk_6m.build.f_cpu=6000000UL
attinyx7opti.menu.clock.extclk_6m.build.speed=6
attinyx7opti.menu.clock.extclk_6m.build.clocksource=2
attinyx7opti.menu.clock.extclk_6m.upload.speed=57600
attinyx7opti.menu.clock.extclk_18432k=18.432 MHz (external clock)
attinyx7opti.menu.clock.extclk_18432k.bootloader.low_fuses=0xE0
attinyx7opti.menu.clock.extclk_18432k.build.f_cpu=18432000UL
attinyx7opti.menu.clock.extclk_18432k.build.speed=18432k
attinyx7opti.menu.clock.extclk_18432k.build.clocksource=2
attinyx7opti.menu.clock.extclk_18432k.upload.speed=115200
attinyx7opti.menu.clock.extclk_14746k=14.746 MHz (external clock)
attinyx7opti.menu.clock.extclk_14746k.bootloader.low_fuses=0xE0
attinyx7opti.menu.clock.extclk_14746k.build.f_cpu=14746000UL
attinyx7opti.menu.clock.extclk_14746k.build.speed=14746k
attinyx7opti.menu.clock.extclk_14746k.build.clocksource=2
attinyx7opti.menu.clock.extclk_14746k.upload.speed=115200
attinyx7opti.menu.clock.extclk_11059k=11.059 MHz (external clock)
attinyx7opti.menu.clock.extclk_11059k.bootloader.low_fuses=0xE0
attinyx7opti.menu.clock.extclk_11059k.build.f_cpu=11059000UL
attinyx7opti.menu.clock.extclk_11059k.build.speed=11059k
attinyx7opti.menu.clock.extclk_11059k.build.clocksource=2
attinyx7opti.menu.clock.extclk_11059k.upload.speed=115200
attinyx7opti.menu.clock.extclk_9216k=9.216 MHz (external clock)
attinyx7opti.menu.clock.extclk_9216k.bootloader.low_fuses=0xE0
attinyx7opti.menu.clock.extclk_9216k.build.f_cpu=9216000UL
attinyx7opti.menu.clock.extclk_9216k.build.speed=9216k
attinyx7opti.menu.clock.extclk_9216k.build.clocksource=2
attinyx7opti.menu.clock.extclk_9216k.upload.speed=115200
attinyx7opti.menu.clock.extclk_7372k=7.372 MHz (external clock)
attinyx7opti.menu.clock.extclk_7372k.bootloader.low_fuses=0xE0
attinyx7opti.menu.clock.extclk_7372k.build.f_cpu=7372000UL
attinyx7opti.menu.clock.extclk_7372k.build.speed=7372k
attinyx7opti.menu.clock.extclk_7372k.build.clocksource=2
attinyx7opti.menu.clock.extclk_7372k.upload.speed=76800

#########################
# Pin Mapping menu      #
#########################
attinyx7opti.menu.pinmap.default=Standard
attinyx7opti.menu.pinmap.digi=Digispark Pro
attinyx7opti.menu.pinmap.digi.build.variant=tinyx7_digi
attinyx7opti.menu.pinmap.legacy=Legacy
attinyx7opti.menu.pinmap.legacy.build.variant=tinyx7_legacy
attinyx7opti.menu.pinmap.default.build.pinmapabr=
attinyx7opti.menu.pinmap.digi.build.pinmapabr=.digi
attinyx7opti.menu.pinmap.legacy.build.pinmapabr=.old

#########################
# BrownOut Detect menu  #
#########################
attinyx7opti.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx7opti.menu.bod.disable.bootloader.bod_bits=111
attinyx7opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx7opti.menu.bod.1v8.bootloader.bod_bits=110
attinyx7opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx7opti.menu.bod.2v7.bootloader.bod_bits=101
attinyx7opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx7opti.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attinyx7opti.menu.millis.enabled=Enabled
attinyx7opti.menu.millis.enabled.build.millis=
attinyx7opti.menu.millis.enabled.build.millisabr=
attinyx7opti.menu.millis.disabled=Disabled (saves flash)
attinyx7opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx7opti.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attinyx7opti.menu.bootentry.1s=Standard (1s wait, for use w/autoreset)
attinyx7opti.menu.bootentry.1s.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.uart}.hex
attinyx7opti.menu.bootentry.8s=8-second (8s wait, for use w. out/autoreset)
attinyx7opti.menu.bootentry.8s_8sec.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}{bootloader.uart}_8sec.hex

