SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                      ####         #   #  ###  ####
#  #   #   #    #  #                #            #   # #     #   #
#  #####   #   ###    ###  #  # # # ###      # # #   #  ###  ####
#  #   #   #    #  #  #  # #  #  #     #     # # #   #     # #   #
#  #   #   #    #  #  #  #  ### # # ###       #   ###  ####  ####
#_____________________________#_______________________________________________________
                           ###

attiny85micr.build.board=AVR_ATTINY85
attiny85micr.build.core=tiny
attiny85micr.build.variant=tinyx5
attiny85micr.build.export_merged_output=false
attiny85micr.bootloader.extended_fuses=0xFE
attiny85micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attiny85micr.bootloader.rstbit=1
attiny85micr.build.usbpinset=
attiny85micr.build.tuneorcal=
attiny85micr.build.softserabr=
attiny85micr.build.softser=
attiny85micr.build.wiremodeabr=
attiny85micr.build.wiremode=
attiny85micr.build.pinmapabr=
attiny85micr.build.bootloader=-DUSING_BOOTLOADER=0x08
attiny85micr.build.bootloaderabr=micr
attiny85micr.upload.tool=micronucleus
attiny85micr.upload.protocol=usb
attiny85micr.bootloader.devpostfix=

#########################
# Optimization menu     #
#########################
attiny85micr.menu.optimization.size=-Os (size, recommended)
attiny85micr.menu.optimization.othree=-O3 (speed)
attiny85micr.menu.optimization.debug=-Og (for advanced debugging)
attiny85micr.menu.optimization.size.build.optimize=-Os
attiny85micr.menu.optimization.othree.build.optimize=-O3
attiny85micr.menu.optimization.debug.build.optimize=-Og
attiny85micr.build.mcu=attiny85
attiny85micr.upload.maximum_size=6524
attiny85micr.upload.maximum_data_size=512

#########################
# Clocking menu options #
#########################
attiny85micr.build.extra_flags=-DBOOT_TUNED165
attiny85micr.menu.clock.pll_165m=16.5 MHz (internal tuned PLL)
attiny85micr.menu.clock.pll_165m.bootloader.low_fuses=0xF1
attiny85micr.menu.clock.pll_165m.build.f_cpu=16500000UL
attiny85micr.menu.clock.pll_165m.build.speed=16m5
attiny85micr.menu.clock.pll_165m.build.clocksource=6
attiny85micr.menu.clock.pll_16m=16 MHz (internal PLL)
attiny85micr.menu.clock.pll_16m.bootloader.low_fuses=0xF1
attiny85micr.menu.clock.pll_16m.build.f_cpu=16000000UL
attiny85micr.menu.clock.pll_16m.build.speed=16
attiny85micr.menu.clock.pll_16m.build.clocksource=6
attiny85micr.menu.clock.pll_8m=8 MHz (prescaled 16 MHz internal PLL)
attiny85micr.menu.clock.pll_8m.bootloader.low_fuses=0xF1
attiny85micr.menu.clock.pll_8m.build.f_cpu=8000000UL
attiny85micr.menu.clock.pll_8m.build.speed=8
attiny85micr.menu.clock.pll_8m.build.clocksource=6
attiny85micr.menu.clock.pll_4m=4 MHz (prescaled 16 MHz internal PLL)
attiny85micr.menu.clock.pll_4m.bootloader.low_fuses=0xF1
attiny85micr.menu.clock.pll_4m.build.f_cpu=4000000UL
attiny85micr.menu.clock.pll_4m.build.speed=4
attiny85micr.menu.clock.pll_4m.build.clocksource=6
attiny85micr.menu.clock.pll_2m=2 MHz (prescaled 16 MHz internal PLL)
attiny85micr.menu.clock.pll_2m.bootloader.low_fuses=0xF1
attiny85micr.menu.clock.pll_2m.build.f_cpu=2000000UL
attiny85micr.menu.clock.pll_2m.build.speed=2
attiny85micr.menu.clock.pll_2m.build.clocksource=6
attiny85micr.menu.clock.pll_1m=1 MHz (prescaled 16 MHz internal PLL)
attiny85micr.menu.clock.pll_1m.bootloader.low_fuses=0xF1
attiny85micr.menu.clock.pll_1m.build.f_cpu=1000000UL
attiny85micr.menu.clock.pll_1m.build.speed=1
attiny85micr.menu.clock.pll_1m.build.clocksource=6

#########################
# Software Serial menu  #
#########################
attiny85micr.menu.softserial.enable=RX on PB1, TX on PB (default PB0)
attiny85micr.menu.softserial.txonly=No receiving, transmit only.
attiny85micr.menu.softserial.txonly.build.softser=-DSOFT_TX_ONLY
attiny85micr.menu.softserial.txonly.build.softserabr=ssTX

#########################
# BrownOut Detect menu  #
#########################
attiny85micr.menu.bod.disable=B.O.D. Disabled (saves power)
attiny85micr.menu.bod.disable.bootloader.bod_bits=111
attiny85micr.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny85micr.menu.bod.1v8.bootloader.bod_bits=110
attiny85micr.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny85micr.menu.bod.2v7.bootloader.bod_bits=101
attiny85micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny85micr.menu.bod.4v3.bootloader.bod_bits=100

#########################
# millis/micros menu    #
#########################
attiny85micr.menu.millis.enabled=Enabled
attiny85micr.menu.millis.enabled.build.millis=
attiny85micr.menu.millis.enabled.build.millisabr=
attiny85micr.menu.millis.disabled=Disabled (saves flash)
attiny85micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny85micr.menu.millis.disabled.build.millisabr=mNONE

#########################
# Boot Entrymode menu   #
#########################
attiny85micr.menu.bootentry.extrf_porf=External Reset and Power On Reset
attiny85micr.menu.bootentry.extrf_porf.bootloader.entrymode=extrf_porf
attiny85micr.menu.bootentry.extrf_safe=External Reset, or if reset pin disabled and HIGH
attiny85micr.menu.bootentry.extrf_safe.bootloader.entrymode=extrf_safe
attiny85micr.menu.bootentry.extrfonly_safe=External Reset only, or if reset pin disabled and HIGH
attiny85micr.menu.bootentry.extrfonly_safe.bootloader.entrymode=extrfonly_safe
attiny85micr.menu.bootentry.wdrf=Watchdog Reset only
attiny85micr.menu.bootentry.wdrf.bootloader.entrymode=wdrf
attiny85micr.menu.bootentry.porf=Power On Reset only
attiny85micr.menu.bootentry.porf.bootloader.entrymode=porf
attiny85micr.menu.bootentry.anyreset=Any reset (but not jump from app)
attiny85micr.menu.bootentry.anyreset.bootloader.entrymode=anyreset
attiny85micr.menu.bootentry.always=Always (permits jump from app)
attiny85micr.menu.bootentry.always.bootloader.entrymode=always
attiny85micr.menu.bootentry.jumper=Jumper (see documentation) (permits jump from app)
attiny85micr.menu.bootentry.jumper.bootloader.entrymode=jumper
attiny85micr.menu.bootentry.always.upload.maximum_size=6588

################################
# Pins used for USB            #
################################
attiny85micr.menu.usbpins.standard=Standard, PB3: D- PB4: D+ PB1: LED
attiny85micr.menu.usbpins.standard.bootloader.usbpinset=
attiny85micr.menu.usbpins.standard.bootloader.usbpinsetname=
attiny85micr.menu.resetpin.reset=Reset pin. Further ISP programming possible
attiny85micr.menu.resetpin.reset.bootloader.rstbit=1
attiny85micr.menu.resetpin.gpio=I/O pin - DANGER: If anything goes wrong, only HV programming can unbrick!
attiny85micr.menu.resetpin.gpio.bootloader.rstbit=0

################################
# Upgrade vs ISP install menu  #
################################
attiny85micr.menu.burnmode.upgrade=Upgrade (via USB)
attiny85micr.menu.burnmode.upgrade.bootloader.file=micronucleus/hex/upgrade-attiny85micr{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attiny85micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attiny85micr.menu.burnmode.install=Fresh Install (via ISP)
attiny85micr.menu.burnmode.install.bootloader.file=micronucleus/hex/attiny85micr{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attiny85micr.menu.burnmode.install.bootloader.tool=avrdude
attiny85micr.menu.burnmode.install.bootloader.flashstring=-Uflash:w:{bootloader.file}:i

